Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: This document needs a rewrite that separates the tutorial content from the reference content.
es_es: Este documento necesita una reescritura que separe el contenido de manual del contenido de referencia.

source: =head2 Overview
es_es: =head2 Introducción

source: In general the cure is to sort the keys (or the values); in particular for Data::Dumper to use the C<Sortkeys> option.
es_es: En general, la cura es ordenar las claves (o valores); en particular para Data::Dumper use la opción C<Sortkeys>.

source: (Note that the delimiter may be longer than one character.)
es_es: (Tenga en cuenta que el delimitador puede ser más largo que un carácter).

source: @animals[1..$#animals]; # gives all except the first element
es_es: @animales[1..$#animales]; # devuelve todos excepto el primero

source: So will C<next>, but since it will execute a C<continue> block, it may be more entertaining.
es_es: También C<next>, pero como ejecutará un bloque C<continue>, quizás se convierta en algo divertido.

source: are exempt from warnings (because they care about truth rather than definedness).
es_es: están exentos de esos avisos (porque tienen en cuenta el valor de verdad en vez de ver si está definido).

source: See L<perlsub/"Persistent variables via state()">.
es_es: Vea L<perlsub/"Variables persistentes vía state()">.

source: See L<threads::shared>.
es_es: Ver L<threads::shared>.

source: =head2 Testing Perl on DG/UX
es_es: =head2 Comprobando Perl en DG/UX

source: For example, in
es_es: Por ejemplo, en

source: =item unlink LIST
es_es: =item unlink LISTA

source: Typically used as follows:
es_es: Típicamente se usa como sigue:

source: =item L<s2p|s2p> and L<psed>
es_es: =item L<s2p|s2p> y L<psed>

source: If the arguments are omitted, it defaults to C<0,0>.
es_es: Si los argumentos son omitidos, el valor predeterminado es C<0,0>.

source: for ($curpos = tell(FILE); $_ = <FILE>; $curpos = tell(FILE)) { # search for some stuff and put it into files
es_es: for ($curpos = tell(FILE); $_ = <FILE>; $curpos = tell(FILE)) { # buscar por algo y ponerlo en los archivos

source: This means for example that the Unicode character properties are as in Unicode 4.0.0.
es_es: Esto significa que, por ejemplo, las propiedades de caracteres Unicode son como en Unicode 4.0.0.

source: unless (EXPR) BLOCK else BLOCK
es_es: unless (EXPR) BLOQUE else BLOQUE

source: Here's a line
es_es: Aquí hay una línea

source: Sets the current priority for a process, a process group, or a user.
es_es: Devuelve la prioridad actual de un proceso, un grupo de procesos o un usuario.

source: The behavior is undefined if LENGTH is greater than the length of the file.
es_es: El comportamiento no está definido si LONGITUD es mayor que la longitud del archivo.

source: If it's too long and an explicit count is provided, C<Z> packs only C<$count-1> bytes, followed by a null byte.
es_es: Si es demasiado largo y se indica un contador explícito, C<Z> empaqueta solo C<$contador-1> bytes, seguido por un byte nulo.

source: The filehandles STDIN, STDOUT, and STDERR are predefined.
es_es: Los identificadores de archivo STDIN, STDOUT y STDERR están predefinidos.

source: printf '<%.5g>', 100.01; # prints "<100.01>"
es_es: printf '<%.5g>', 100.01; # imprime "<100.01>"

source: When you write to the database you will have to use something like this:
es_es: Para escribir en la base de datos debe usar una instrucción similar a la siguiente:

source: Previously, F<.pmc> files were loaded only if more recent than the matching F<.pm> file.
es_es: Anteriormente, los archivos F<.pmc> sólo se cargaban si eran más recientes que el archivo F<.pm>.

source: You cannot currently get the precision from a specified number, but it is intended that this will be possible in the future, for example using C<.*2$>:
es_es: Actualmente, no se puede conseguir la precisión de un número determinado, pero es intención de que esto será posible en el futuro, por ejemplo, con C<.*2$>:

source: print(" MiXeD"), redo LOOP if /\G\pL+\b[,.;]?\s*/gc;
es_es: print(" MeZcLaDoS"), redo LOOP if /\G\pL+\b[,.;]?\s*/gc;

source: Here is the output (split into several lines):
es_es: Aquí está la salida (dividido en varias líneas):

source: give non-standard executables non-standard names, and clearly document the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.
es_es: dar nombres no estándares a los ejecutables no estándares, y claramente documentar las diferencias en páginas del manual (o equivalente), junto con instrucciones sobre dónde obtener la Versión Estándar.

source: Backslash interpolation also happens at compile time.
es_es: La interpolación de contrabarras también sucede en tiempo de compilación.

source: Some frequently seen examples:
es_es: Algunos ejemplos que suelen encontrarse frecuentemente:

source: As more readable alternatives to C<&&> and C<||> when used for control flow, Perl provides the C<and> and C<or> operators (see below).
es_es: Como alternativas más legibles a C<&&> y C<||> cuando se usan para control de flujo, Perl proporciona los operadores C<and> y C<or> (vea más adelante).

source: Described in L<perltie> and L<AnyDBM_File>.
es_es: Se describe en L<perltie> y L<AnyDBM_File>.

source: followed by
es_es: seguido por

source: 0377 # octal (only numbers, begins with 0)
es_es: 0377 # octal (solo números, comenzando con 0)

source: Be aware that the optimizer might have optimized call frames away before C<caller> had a chance to get the information.
es_es: Cuidado con el optimizador, que puede optimizar marcos de llamada antes de que C<caller> tenga la oportunidad de obtener la información.

source: An array of an array is just a regular old array @AoA that you can get at with two subscripts, like C<$AoA[3][2]>.
es_es: Un array de un array es justo un array @AoA normal sobre la que se puede aplicar dos subíndices, como C<$AoA[3][2]>.

source: Some modules available both within the perl core and independently from CPAN ("dual-life modules") have not yet had these changes applied; the changes will be integrated into future stable perl releases as the modules are updated on CPAN.
es_es: Algunos módulos disponibles, tanto en el núcleo de perl e independientes de CPAN ("módulos con doble vida") aún no han tenido los cambios aplicados; los cambios se integrarán en futuras versiones estables de perl, ya que los módulos se actualizan en CPAN.

source: Avoid using C<grep()> (or C<map()>) or `backticks` in a void context, that is, when you just throw away their return values.
es_es: Evite usar C<grep()> (o C<map()>) o `acentos graves` en contexto nulos, es decir, cuando usted no va usar los valores de retorno.

source: Support C<inf> for C<make>/C<emake>
es_es: Soporte de C<inf> para C<make>/C<emake>

source: =item push EXPR,LIST
es_es: =item push EXPR,LISTA

source: The only difference is that you're now using characters instead of bytes.
es_es: La única diferencia es que ahora trabajamos con caracteres en lugar de bytes.

source: Unnecessary assignment optimised away in
es_es: Optimizadas las asignaciones innecesarias.

source: Like C<if>, C<unless> can be followed by C<else>.
es_es: Como C<if>, C<unless> puede ser seguido por C<else>.

source: Another description starts with notions of "better"/"worse".
es_es: Otra descripción comienza con las nociones de "mejor"/"peor".

source: # same thing
es_es: # lo mismo

source: Since Perl 5.8.1 the ordering is different even between different runs of Perl for security reasons (see L<perlsec/"Algorithmic Complexity Attacks">).
es_es: Desde Perl 5.8.1 la ordenación es diferente incluso entre diferentes ejecuciones de Perl por razones de seguridad (ver L<perlsec/"Ataques por Complejidad Algorítmica">).

source: Mainly due to security reasons, the "random ordering" of hashes has been made even more random.
es_es: Debido principalmente a razones de seguridad, el "orden aleatorio" de los hashes se ha hecho aún más aleatorio.

source: Assignment to a list (or slice, which is just a list anyway) also evaluates the right-hand side in list context.
es_es: La asignación a una lista (o a una porción, que también es una lista después de todo) también evalúa el lado derecho en contexto de lista.

source: That's probably because you forgot libraries, or library paths differ.
es_es: Probablemente se deba a que olvidó copiar las bibliotecas, o a que las rutas de acceso de las bibliotecas difieren.

source: ISBN 1-59059-454-1 [1st edition July 2005]
es_es: ISBN 1-59059-454-1 [1ª edición - Julio de 2005]

source: This will automatically accept all the defaults and in particular /usr/local/ as installation directory.
es_es: Esto, automáticamente, aceptará todos los valores predeterminados y, en particular, /usr/local/ como directorio de instalación.

source: C<ExtUtils::Constant> upgraded to version 0.17
es_es: C<ExtUtils::Constant> actualizado a la versión 0.17

source: =item each ARRAY X<array, iterator>
es_es: =item each ARRAY X<array, iterator> X<array, iterador>

# print "long doubles by default ";
source: print "long doubles by default\n";
es_es: print "long doubles por defecto\n";

source: Here are some examples:
es_es: Aquí algunos ejemplos:

source: One can read this document in the following formats:
es_es: Se puede leer este documento en los siguientes formatos:

source: Testing for exact floating-point equality or inequality is not a good idea.
es_es: No es una buena idea comprobar la igualdad o la desigualdad exacta de números en punto flotante.

source: This is pretty much useful only to find out whether Perl's internal hashing algorithm is performing poorly on your data set.
es_es: Esto es útil solamente para conocer si el algoritmo interno de los hashes está teniendo un bajo rendimiento sobre un conjunto de datos.

source: Similarly, F<s2p> converts F<sed> scripts to Perl programs.
es_es: De manera similar, F<s2p> convierte scripts F<sed> en programas Perl.

source: This emulates the C<syswrite> function (or vice versa):
es_es: Esto emula la función C<syswrite> (o viceversa):

source: warn "not a decimal number" unless /^-?\d+\.?\d*$/; # rejects .2
es_es: warn "no es número real" unless /^-?\d+\.?\d*$/; # rechaza .2

source: $b = '(.)\g{1}'; # Avoids the problems.
es_es: $b = '(.)\g{1}'; # Evita los problemas.

source: However, it cannot be used by itself to fetch single characters without waiting for the user to hit enter.
es_es: Sin embargo, esto no puede ser usado para extraer caracteres sueltos sin esperar a que el usuario pulse la tecla de I<Enter>.

source: (Note that you must fully qualify the sub's name, as unqualified C<INC> is always forced into package C<main>.) Here is a typical code layout:
es_es: (Tenga en cuenta que debe cualificar completamente el nombre de la subrutina, así como un no cualificado C<INC> está siempre forzado en el paquete C<main>). Este es un diseño de código típico:

source: Boolean contexts, such as:
es_es: En contextos booleanos, como en:

source: =item chomp( LIST )
es_es: =item chomp( LISTA )

source: perl 5.8.0 sets C<$^X> where possible to a full path by asking the operating system.
es_es: perl 5.8.0 pone C<$^X> hasta donde sea posible a todo el camino completo preguntando al sistema operativo.

source: Adds support for Berkeley DB 4.4.
es_es: Añadido soporte para Berkeley DB 4.4.

source: They were v-strings from Perl 5.6.0 to Perl 5.8.0, but that caused more confusion and breakage than good.
es_es: Fueron v-strings desde Perl 5.6.0 a Perl 5.8.0, pero causó más confusión y problemas, que bienes.

source: The return value of tell() for the standard streams like the STDIN depends on the operating system: it may return -1 or something else.
es_es: El valor de retorno de tell() para los flujos estándares como STDIN depende del sistema operativo: puede devolver -1 o algo más.

source: If you don't want it to test the right operand until the next evaluation, as in B<sed>, just use three dots ("...") instead of two.
es_es: Si no quiere poner a prueba el operando derecho hasta la próxima evaluación, al igual que en B<sed>, sólo tiene que utilizar tres puntos ("...") en lugar de dos.

source: Thanks to Gerard Goossen from TTY.
es_es: Gerard Goossen de TTY.

source: =item syswrite FILEHANDLE,SCALAR,LENGTH
es_es: =item syswrite IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD

source: B<IMPORTANT>: Without patch 2401, a kernel bug in Irix 6.2 will cause your machine to panic and crash when running threaded perl.
es_es: B<IMPORTANTE>: Sin el parche 2401, un error del kernel en Irix 6.2 causará que su máquina entre en pánico y casque cuando ejecute perl enhebrado.

source: This document describes differences between the 5.7.2 release and the 5.7.3 release.
es_es: Este documento describe las diferencias entre la versión 5.7.2 y la versión 5.7.3.

source: \s [3] Match a whitespace character
es_es: \s [3] Coincide con un carácter espacio en blanco

source: Use C<sysseek> instead.
es_es: Use en su lugar C<sysseek>.

source: %E like %e, but using an upper-case "E"
es_es: %E como %e, pero usando una letra "E" mayúscula

source: Using the C<eval{}> form as an exception trap in libraries does have some issues.
es_es: Usar la forma C<eval{}> como una trampa de excepciones en bibliotecas puede tener algunos problemas.

source: The exceptions, C<abs>, C<++> and C<-->, do not change their behavior with C<use integer;>
es_es: Las excepciones son C<abs>, C<++> y C<-->, que no cambian su comportamiento con C<use integer;>

source: <signal.h> is now always included.
es_es: <signal.h> ahora es siempre incluido.

source: All communication with the outside world (anything outside of your current Perl process) is done in binary.
es_es: La comunicación con el mundo exterior (todo lo que esté fuera del proceso Perl actual) se realiza en binario.

source: (It used to do so in Perl 4, but we had to break this to make sure destructors were called when expected.) X<$#> X<array, length>
es_es: (Así solía hacerse en Perl 4, aunque aunque tuvimos que cambiarlo para asegurar que los destructores eran llamados cuando se esperaba hacerlo). X<$#> X<array, length> X<array, longitud>

source: If you're storing handles in an array or hash, or in general whenever you're using any expression more complex than a bareword handle or a plain, unsubscripted scalar variable to retrieve it, you will have to use a block returning the filehandle value instead, in which case the LIST may not be omitted:
es_es: Si está almacenando identificadores en un array o hash, o en general, en cualquier expresión más compleja que un simple identificador o una sencilla variable escalar sin subíndice, para acceder a él, tendrá que utilizar un bloque que retorne el valor del identificador de archivo, en cuyo caso la LISTA no puede ser omitida:

source: It will often point out exactly where the trouble is.
es_es: Normalmente le indicará dónde está el problema.

source: If the final value specified is not in the sequence that the magical increment would produce, the sequence goes until the next value would be longer than the final value specified.
es_es: Si el valor final especificado no está en la secuencia que el incremento mágico produciría, la secuencia continúa hasta el siguiente valor que sería más largo que el valor final fijado.

source: =item order of arguments
es_es: =item orden de los argumentos

source: # sort numerically descending
es_es: # ordenación numérica descendente

source: will set C<$res = 4>.
es_es: será C<$res = 4>.

source: But generally, a block is delimited by curly brackets, also known as braces.
es_es: Pero generalmente, un bloque está delimitado por llaves.

source: See L<perlport/"Supported Platforms"> for a listing.
es_es: Encontrará una lista en la sección "Plataformas compatibles" de L<perlport>.

source: @files = glob($files[$i]);
es_es: @archivos = glob($archivos[$i]);

source: (This makes learning Perl easier for C folks.) With very few exceptions, these all operate on scalar values only, not array values.
es_es: (Esto hace el aprendizaje de Perl más fácil para la gente de C). Con pocas excepciones, todas éstas operan solamente en valores escalares, no en valores de array.

source: die "Can't readlink $sym: $!"
es_es: die "No puedo enlazar simbólicamente con $sym: $!"

source: C<\N{U+I<hex number>}> is always interpreted as a Unicode code point, so that C<\N{U+0050}> is "P" even on EBCDIC platforms.
es_es: C<\N{U+I<número hex.>}> siempre es interpretado como un punto de código Unicode, por lo que C<\N{U+0050}> es "P", incluso en plataformas EBCDIC.

source: $me = myname $0 or die "can't get myname";
es_es: $me = minombre $0 or die "no puedo obtener minombre";

source: This means that if a developer only needs a module for the BAR standard, they should not be forced to install libraries for FOO as well.
es_es: Esto significa que si un desarrollador sólo necesita un módulo para el estándar BAR, no debe verse obligado a instalar las bibliotecas para FOO.

source: If the length of the input string is not even, it behaves as if padded by a null character at the end.
es_es: Si la longitud de la cadena de entrada no es par, se comporta como si estuviera rellenada con un carácter nulo al final.

source: If you've found a bug with the perl interpreter or one of the modules in the standard library (those that come with Perl), you can use the L<perlbug> utility that comes with Perl (>= 5.004).
es_es: Si ha encontrado un error en el intérprete de perl o en uno de los módulos de la biblioteca estándar (los que se incluyen con Perl), puede usar la utilidad L<perlbug> incluida en Perl (>= 5.004) para enviar un informe.

source: (Note also that each C<use> statement creates a C<require> frame inside an C<eval EXPR> frame.) $subroutine may also be C<(unknown)> if this particular subroutine happens to have been deleted from the symbol table.
es_es: (Note también que cada instrucción C<use> crea un marco C<require> dentro de un marco C<eval EXPR>). $subrutina puede ser también C<(unknown)> (desconocida) si esta subrutina en particular parece haber sido borrada de la tabla de símbolos.

source: There is no such thing as an unvarying, physical newline character.
es_es: No existe tal cosa como un invariable o físico, carácter de nueva línea.

source: For a regular expression to match, the I<entire> regular expression must match, not just part of it.
es_es: Para que una expresión regular coincida, debe coincidir la expresión I<entera>, no sólo parte de ella.

source: Do not try to use Perl's malloc, this will lead into very mysterious errors (especially with -Duse64bitall).
es_es: No intente usar el malloc de Perl, esto le conducirá a errores muy misteriosos (especialmente con -Duse64bitall)

source: This is described in more detail below and in L<perlref>.
es_es: Ésto se describe con mayor detalle más abajo y en L<perlref>.

source: Linenumbers in Perl scripts may now be greater than 65536, or 2**16.
es_es: Los números de línea en Perl ahora pueden ser mayores de 65536, o 2**16.

source: The Perl internal debugging macros DEBUG() and DEB() have been renamed to PERL_DEBUG() and PERL_DEB() to avoid namespace conflicts.
es_es: Las macros internas de depueración Perl DEBUG() y DEB() han sido renombradas a PERL_DEBUG() y PERL_DEB() para evitar conflictos en el espacio de nombres.

source: That's because the implicit derefererence will never autovivify an undefined variable the way C<@{ }> always will:
es_es: Eso es así porque la desrefererencia implícita nunca autovivificará una variable indefinida de la misma manera que C<@{}> lo hace siempre:

source: print << `EOC`; # execute command and get results
es_es: print << `EOC`; # ejecuta comando y obtén resultados

source: $Some_Caps_Here package-wide global/static
es_es: $Algunas_Mayusculas Ámbito de paquete/estática

source: In general, it is better to create directories with a permissive MASK and let the user modify that with their C<umask> than it is to supply a restrictive MASK and give the user no way to be more permissive.
es_es: En general, es mejor crear directorios con una MÁSCARA permisiva y dejar que el usuario lo modifique con su C<umask> que suministrar una MÁSCARA restrictiva y no darle al usuario una forma de ser más permisivo.

source: Scalar or list context propagates downward into the 2nd or 3rd argument, whichever is selected.
es_es: Contexto escalar o lista es propagado hacia adelante, en el segundo o tercer argumento, cualquiera que sea el seleccionado.

source: =head2 Handling of pmc files
es_es: =head2 Gestión de archivos pmc

source: Reading in the whole file at one time is called slurping.
es_es: La lectura de un archivo completo se suele llamar "slurping" (succión).

source: =head2 Combining RE Pieces
es_es: =head2 Combinando piezas RE

source: =head2 Regexp Quote-Like Operators X<operator, regexp>
es_es: =head2 Operadores Regexp entrecomillados X<operator, regexp> X<operador, regexp>

source: Like C<ioctl>, it maps a C<0> return from the system call into C<"0 but true"> in Perl.
es_es: Como C<ioctl>, mapea un C<0> devuelto de la llamada del sistema en un C<"0 but true"> ("0 pero cierto") en Perl.

source: The auto-decrement operator is not magical.
es_es: El operador de auto decremento no es mágico.

source: Any subroutine named C<ToLower> will be ignored.
es_es: Cualquier subrutina denominada C<ToLower> será ignorada.

source: Restricted hashes and their place holders are now allocated and deleted at slightly different times, but this should not be visible to user code.
es_es: Hashes restringidos y sus marcadores de posición son ahora reservados y eliminados en momentos ligeramente diferentes, pero esto no debería ser apreciado por el código de usuario.

source: To make a list reference that does I<NOT> interpolate, see L<perlref>.
es_es: Para hacer referencia a una lista que <NO> interpole, vea L<perlref> .

source: %U a synonym for %lu
es_es: %U un sinónimo para %lu

source: perlglossary Perl Glossary
es_es: perlglossary Glosario

source: The first pass is finding the end of the quoted construct, where the information about the delimiters is used in parsing.
es_es: El primer paso es encontrar el final de la construcción entrecomillada, donde la información sobre los delimitadores se utiliza en el análisis.

source: into the next variable in the parameter list
es_es: en la siguiente variable en la lista de parámetros

source: The fact that you can store such "large" numbers does not mean that the I<operations> over these numbers will use all of the significant digits.
es_es: El hecho de poder almacenar números tan "grandes" no significa que en las I<operaciones> con estos números se usen todos los dígitos significativos.

source: $_ = "The food is under the bar in the barn.";
es_es: $_ = "En la mesa, al mediodía, se come, y en el comedor se cena.";

source: perl5138delta Perl changes in version 5.13.8
es_es: perl5138delta Cambios en la versión 5.13.8

source: C<canonpath> on Win32 now collapses C<foo/..> (or C<foo\..>) sections correctly, rather than doing the "misguided" work it was previously doing.
es_es: Ahora, C<canonpath>, en Win32, colapsa secciones C<foo/..> (o C<foo\..>) correctamente, en lugar de la "equivocada" tarea que hacía antes.

source: require 5.6.1; # ditto
es_es: require 5.6.1; # ídem

source: This makes it useful for control flow:
es_es: Esto lo hace útil para el control de flujo:

source: For BeOS specifics problems feel free to mail to: Ingo Weinhold <bonefish@cs.tu-berlin.de>
es_es: Para información específica de problemas BeOS no dude en enviar un correo a: Ingo Weinhold <bonefish@cs.tu-berlin.de>
